taurus/post-del-seq.yaml
execution:
- concurrency: 1
  ramp-up: 5s
  hold-for: 2m
  throughput: 100
  scenario: TwoCheckout



scenarios:
  TwoCheckout:
    default-address: http://127.0.0.1:5000/
    requests:

      - url: /city
        method: POST
        headers:
          content-type: application/json
          Authorization: "Basic dG9tOjMyMQ=="
        body:
          cityname: "anananak"
          inhabitants: 334

      - url: /sensor
        method: POST
        headers:
          content-type: application/json
          Authorization: "Basic dG9tOjMyMQ=="
        body:
          height: 35
          latitude: 50.104
          longitude: 10.423
          city_id: 3

      - url: /sensordata
        method: POST
        headers:
          content-type: application/json
          Authorization: "Basic dG9tOjMyMQ=="
        body:
          temperature: 34
          sensor_id: 6

      - url: /sensordata/12
        method: DELETE
        headers:
          content-type: application/json
          Authorization: "Basic dG9tOjMyMQ=="

      - url: /sensor/6
        method: DELETE
        headers:
          content-type: application/json
          Authorization: "Basic dG9tOjMyMQ=="

      - url: /city/3
        method: DELETE
        headers:
          content-type: application/json
          Authorization: "Basic dG9tOjMyMQ=="